Tekla Open API Reference for Tekla Structures 2025
BendSurfaceNode Properties
The BendSurfaceNode type exposes the following members.
Properties
Name | Description
IsAutomatic
 Gets a value indicating whether this geometry node was automatically generated (returns false if it was originally a user-defined part)
Surface
 Gets the bend surface geometry.
Top
See Also
Reference
BendSurfaceNode Class
Tekla.Structures.Model Namespace